eisup_2019_docmng_integration/src/Documents/абс_ВыбытиеОСРЖД/абс_ВыбытиеОСРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ВыбытиеОСРЖД</name>
  <basedOn>Document.СписаниеОС</basedOn>
  <basedOn>Document.абс_ЧастичнаяЛиквидацияОС</basedOn>
  <registerRecords>AccumulationRegister.абс_СтоимостьОСРЖД</registerRecords>
  <registerRecords>AccountingRegister.абс_МеждународныйОСРЖД</registerRecords>
  <registerRecords>InformationRegister.абс_ОсновныеСредстваРЖД</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.абс_ЧастичнаяЛиквидацияОС</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.ПодготовкаКПередачеОС</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧастичнаяЛиквидация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьАмортизацию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Амортизация</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетСписания</name>
      <type>
        <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоСписания1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоСписания2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоСписания3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/AccumulationRegisters/абс_СтоимостьОСРЖД/абс_СтоимостьОСРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_СтоимостьОСРЖД</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/СтоимостьОСБухгалтерскийУчет/СтоимостьОСБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьОСБухгалтерскийУчет</name>
  <comment>(Регл)</comment>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыСобытийОС</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентПересчета</name>
    <comment>Только для переоценки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ОсновныеСредстваРЖД/абс_ОсновныеСредстваРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ОсновныеСредстваРЖД</name>
  <comment>(Упр) Сведения об объектах ОС  для целей РЖД</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <comment>Организация, на балансе которой учитывется объект ОС в международном учете</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПринятияКУчету</name>
    <comment>Дата принятия объекта к международному учету</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестонахождениеОбъекта</name>
    <comment>Подразделение организации, в котором находится объект ОС</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ВидыСостоянийОС</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчета</name>
    <comment>Счет учета в плане счетов Международный РЖД</comment>
    <type>
      <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <comment>Срок полезного использования в месяцах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизацию</name>
    <comment>Булево - начиляется амортизация или нет</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизации</name>
    <comment>Метод начисления амортизации по международному учету</comment>
    <type>
      <types>EnumRef.МетодыНачисленияАмортизацииОСМеждународный</types>
    </type>
  </resources>
  <resources>
    <name>СчетНачисленияАмортизации</name>
    <comment>Счет, на котором накапливается начисленная амортизация</comment>
    <type>
      <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <comment>Первоначальная (историческая) стоимость объекта</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СправедливаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимость</name>
    <comment>Стоимость, которая должна остаться после истечения срока полезного использования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <comment>Счет учета, в дебет которого относятся амортизационные отчисления</comment>
    <type>
      <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
    </type>
  </resources>
  <resources>
    <name>Субконто1</name>
    <comment>Субконто первого уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто2</name>
    <comment>Субконто второго уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто3</name>
    <comment>Субконто третьего уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>ПредполагаемыйОбъемПродукции</name>
    <comment>Используется при амортизации пропорционально объему продукции</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНачисленнойАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УбытокОтОбесценения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетСниженияСтоимости</name>
    <type>
      <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ВидыДвиженийБухгалтерии/ВидыДвиженийБухгалтерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийБухгалтерии</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Дебет</name>
  </enumValues>
  <enumValues>
    <name>Кредит</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/СостоянияОС/СостоянияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОС</name>
  <comment>Состояния ОС</comment>
  <enumValues>
    <name>ПринятоКУчету</name>
    <comment>Принято к учету</comment>
  </enumValues>
  <enumValues>
    <name>ВведеноВЭксплуатацию</name>
    <comment>Введено в эксплуатацию</comment>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
    <comment>Снято с учета</comment>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ВыбытиеОСРЖД/ManagerModule.bsl
Функция ПолучитьСтруктуруЗапросовПроведения(ТипДокументаОснования) Экспорт 
	
	СтруктураЗапросов = Новый Структура;
	СтруктураЗапросов.Вставить("абс_МеждународныйУчетОСРЖД_ТекстЗапросаВидыСубконтоСчетов", абс_МеждународныйУчетОСРЖД.ТекстЗапросаВидыСубконтоСчетов("ВидыСубконтоСчетов"));
	СтруктураЗапросов.Вставить("абс_МеждународныйУчетОСРЖД_ТекстЗапросаСоответствиеСчетовХозрасчетныйРЖД", абс_МеждународныйУчетОСРЖД.ТекстЗапросаСоответствиеСчетовХозрасчетныйМеждународныйОСРЖД("Период",, "СоответствиеСчетовХозрасчетныйРЖД"));
	СтруктураЗапросов.Вставить("ТекстЗапросаСоответствиеСчетовХозрасчетныйМеждународныйОСРЖД", абс_МеждународныйУчетОСРЖД.ТекстЗапросаСоответствиеСчетовХозрасчетныйМеждународныйОСРЖД("Период",, "СоответствиеСчетовХозрасчетныйРЖД"));
	
	Если ТипДокументаОснования = Тип("ДокументСсылка.абс_ЧастичнаяЛиквидацияОС") Тогда 	
		ДобавитьЗапросыДляВыбытие_Ликвидация(СтруктураЗапросов);
	Иначе
		ДобавитьЗапросыДляВыбытие_Остальные(СтруктураЗапросов);
	КонецЕсли;
	
	Возврат СтруктураЗапросов;
	
КонецФункции

Процедура ДобавитьЗапросыДляВыбытие_Ликвидация(СтруктураЗапросов)

	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_ВыбытиеОСРЖДОсновныеСредства.ОсновноеСредство,
		|	абс_ВыбытиеОСРЖДОсновныеСредства.НачислятьАмортизацию
		|ПОМЕСТИТЬ ТабличнаяЧастьОсновныеСредства
		|ИЗ
		|	Документ.абс_ВыбытиеОСРЖД.ОсновныеСредства КАК абс_ВыбытиеОСРЖДОсновныеСредства
		|ГДЕ
		|	абс_ВыбытиеОСРЖДОсновныеСредства.Ссылка = &Ссылка";
		
	СтруктураЗапросов.Вставить("Выбытие_Ликвидация_ТекстЗапросаТабличнаяЧастьОсновныеСредства", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_СтоимостьОСРЖДОстатки.ОсновноеСредство,
		|	абс_СтоимостьОСРЖДОстатки.СтоимостьОстаток КАК Стоимость,
		|	абс_СтоимостьОСРЖДОстатки.АмортизацияОстаток КАК Амортизация
		|ПОМЕСТИТЬ СтоимостьОсновныхСредств
		|ИЗ
		|	РегистрНакопления.абс_СтоимостьОСРЖД.Остатки(
		|			&МоментДокумента,
		|			ОсновноеСредство В
		|					(ВЫБРАТЬ
		|						ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
		|					ИЗ
		|						ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства)
		|				И Организация = &Организация) КАК абс_СтоимостьОСРЖДОстатки";
		
	СтруктураЗапросов.Вставить("Выбытие_Ликвидация_ТекстЗапросаСтоимостьОсновныхСредств", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СтоимостьОСБухгалтерскийУчетОстатки.ОсновноеСредство КАК ОсновноеСредство,
		|	СтоимостьОСБухгалтерскийУчетОстатки.СтоимостьОстаток КАК Стоимость,
		|	СтоимостьОСБухгалтерскийУчетОстатки.АмортизацияОстаток КАК Амортизация
		|ПОМЕСТИТЬ СтоимостьОсновныхСредствБУ
		|ИЗ
		|	РегистрНакопления.СтоимостьОСБухгалтерскийУчет.Остатки(
		|			&МоментОснования,
		|			Организация = &Организация
		|				И ОсновноеСредство В
		|					(ВЫБРАТЬ
		|						ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
		|					ИЗ
		|						ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства)) КАК СтоимостьОСБухгалтерскийУчетОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
		
	СтруктураЗапросов.Вставить("Выбытие_Ликвидация_ТекстЗапросаСтоимостьОсновныхСредствБУ", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство,
		|	СУММА(СтоимостьОС.Стоимость) КАК Стоимость,
		|	СУММА(СтоимостьОС.Амортизация) КАК Амортизация
		|ПОМЕСТИТЬ СписаниеБУ
		|ИЗ
		|	РегистрНакопления.СтоимостьОСБухгалтерскийУчет КАК СтоимостьОС
		|ГДЕ
		|	СтоимостьОС.Период = &Период
		|	И СтоимостьОС.Регистратор = &ДокументОснование
		|	И СтоимостьОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И СтоимостьОС.Активность
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьОС.ОсновноеСредство
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
		
	СтруктураЗапросов.Вставить("Выбытие_Ликвидация_ТекстЗапросаСписаниеБУ", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СтоимостьОсновныхСредств.ОсновноеСредство,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СтоимостьОсновныхСредствБУ.Стоимость, 0) = 0
		|			ТОГДА СтоимостьОсновныхСредств.Стоимость
		|		ИНАЧЕ СтоимостьОсновныхСредств.Стоимость * ЕСТЬNULL(СписаниеБУ.Стоимость, 0) / СтоимостьОсновныхСредствБУ.Стоимость
		|	КОНЕЦ КАК Стоимость,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СтоимостьОсновныхСредствБУ.Стоимость, 0) = 0
		|			ТОГДА СтоимостьОсновныхСредств.Амортизация
		|		ИНАЧЕ СтоимостьОсновныхСредств.Стоимость * ЕСТЬNULL(СписаниеБУ.Амортизация, 0) / СтоимостьОсновныхСредствБУ.Стоимость
		|	КОНЕЦ КАК Амортизация
		|ПОМЕСТИТЬ ДанныеДляФормированияДвижений
		|ИЗ
		|	СтоимостьОсновныхСредств КАК СтоимостьОсновныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОсновныхСредствБУ КАК СтоимостьОсновныхСредствБУ
		|		ПО СтоимостьОсновныхСредств.ОсновноеСредство = СтоимостьОсновныхСредствБУ.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ СписаниеБУ КАК СписаниеБУ
		|		ПО СтоимостьОсновныхСредств.ОсновноеСредство = СписаниеБУ.ОсновноеСредство";
		
	СтруктураЗапросов.Вставить("Выбытие_Ликвидация_ТекстЗапросаДанныеДляФормированияДвижений", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПериодыРегистраторыСреза.Период,
		|	ПериодыРегистраторыСреза.Регистратор,
		|	ПериодыРегистраторыСреза.ОсновноеСредство,
		|	абс_ОсновныеСредстваРЖД.Организация,
		|	абс_ОсновныеСредстваРЖД.ДатаПринятияКУчету,
		|	абс_ОсновныеСредстваРЖД.МестонахождениеОбъекта,
		|	абс_ОсновныеСредстваРЖД.МОЛ,
		|	абс_ОсновныеСредстваРЖД.Состояние,
		|	абс_ОсновныеСредстваРЖД.СчетУчета,
		|	абс_ОсновныеСредстваРЖД.СрокПолезногоИспользования,
		|	абс_ОсновныеСредстваРЖД.НачислятьАмортизацию,
		|	абс_ОсновныеСредстваРЖД.МетодНачисленияАмортизации,
		|	абс_ОсновныеСредстваРЖД.СчетНачисленияАмортизации,
		|	абс_ОсновныеСредстваРЖД.ПервоначальнаяСтоимость,
		|	абс_ОсновныеСредстваРЖД.СправедливаяСтоимость,
		|	абс_ОсновныеСредстваРЖД.ЛиквидационнаяСтоимость,
		|	абс_ОсновныеСредстваРЖД.СчетЗатрат,
		|	абс_ОсновныеСредстваРЖД.Субконто1,
		|	абс_ОсновныеСредстваРЖД.Субконто2,
		|	абс_ОсновныеСредстваРЖД.Субконто3,
		|	абс_ОсновныеСредстваРЖД.ПредполагаемыйОбъемПродукции,
		|	абс_ОсновныеСредстваРЖД.СуммаНачисленнойАмортизации,
		|	абс_ОсновныеСредстваРЖД.УбытокОтОбесценения,
		|	абс_ОсновныеСредстваРЖД.КоэффициентУскорения,
		|	абс_ОсновныеСредстваРЖД.СчетСниженияСтоимости
		|ПОМЕСТИТЬ ПараметрыОсновныхСредствРЖД
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
		|		ПериодыСреза.Период КАК Период,
		|		МАКСИМУМ(абс_ОсновныеСредстваРЖД.Регистратор) КАК Регистратор
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ТабличнаяЧастьОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|			МАКСИМУМ(абс_ОсновныеСредстваРЖД.Период) КАК Период
		|		ИЗ
		|			ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
		|				ПО ТабличнаяЧастьОсновныеСредства.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство
		|					И (абс_ОсновныеСредстваРЖД.Период <= &Период)
		|					И (абс_ОсновныеСредстваРЖД.Активность)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТабличнаяЧастьОсновныеСредства.ОсновноеСредство) КАК ПериодыСреза
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
		|			ПО ПериодыСреза.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство
		|				И ПериодыСреза.Период = абс_ОсновныеСредстваРЖД.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПериодыСреза.ОсновноеСредство,
		|		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
		|		ПО ПериодыРегистраторыСреза.Период = абс_ОсновныеСредстваРЖД.Период
		|			И ПериодыРегистраторыСреза.Регистратор = абс_ОсновныеСредстваРЖД.Регистратор
		|			И ПериодыРегистраторыСреза.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство";
		
	СтруктураЗапросов.Вставить("абс_ВнеоборотныеАктивы_ТекстЗапроса_ОсновныеСредстваРЖДПоТаблицеОС", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Организация,
		|	ДанныеДляФормированияДвижений.ОсновноеСредство,
		|	ДанныеДляФормированияДвижений.Стоимость,
		|	ДанныеДляФормированияДвижений.Амортизация
		|ИЗ
		|	ДанныеДляФормированияДвижений КАК ДанныеДляФормированияДвижений";
		
	СтруктураЗапросов.Вставить("Выбытие_Ликвидация_ТекстЗапросаТаблица_абс_СтоимостьОСРЖД", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	ПараметрыОсновныхСредствРЖД.ОсновноеСредство,
		|	&организация,
		|	ПараметрыОсновныхСредствРЖД.ДатаПринятияКУчету,
		|	ПараметрыОсновныхСредствРЖД.МестонахождениеОбъекта,
		|	ПараметрыОсновныхСредствРЖД.МОЛ,
		|	ПараметрыОсновныхСредствРЖД.Состояние КАК Состояние,
		|	ПараметрыОсновныхСредствРЖД.СчетУчета,
		|	ПараметрыОсновныхСредствРЖД.СрокПолезногоИспользования,
		|	ПараметрыОсновныхСредствРЖД.НачислятьАмортизацию КАК НачислятьАмортизацию,
		|	ПараметрыОсновныхСредствРЖД.МетодНачисленияАмортизации,
		|	ПараметрыОсновныхСредствРЖД.СчетНачисленияАмортизации,
		|	ПараметрыОсновныхСредствРЖД.ПервоначальнаяСтоимость,
		|	ВЫБОР
		|		КОГДА ПараметрыОсновныхСредствРЖД.СправедливаяСтоимость > ЕСТЬNULL(ДанныеДляФормированияДвижений.Стоимость, 0)
		|			ТОГДА ПараметрыОсновныхСредствРЖД.СправедливаяСтоимость - ЕСТЬNULL(ДанныеДляФормированияДвижений.Стоимость, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СправедливаяСтоимость,
		|	ПараметрыОсновныхСредствРЖД.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
		|	ПараметрыОсновныхСредствРЖД.СчетЗатрат,
		|	ПараметрыОсновныхСредствРЖД.Субконто1,
		|	ПараметрыОсновныхСредствРЖД.Субконто2,
		|	ПараметрыОсновныхСредствРЖД.Субконто3,
		|	ПараметрыОсновныхСредствРЖД.ПредполагаемыйОбъемПродукции,
		|	ЕСТЬNULL(СтоимостьОсновныхСредств.Амортизация, 0) - ЕСТЬNULL(ДанныеДляФормированияДвижений.Амортизация, 0) КАК СуммаНачисленнойАмортизации,
		|	ПараметрыОсновныхСредствРЖД.УбытокОтОбесценения,
		|	ПараметрыОсновныхСредствРЖД.КоэффициентУскорения,
		|	ПараметрыОсновныхСредствРЖД.СчетСниженияСтоимости
		|ИЗ
		|	ДанныеДляФормированияДвижений КАК ДанныеДляФормированияДвижений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредствРЖД КАК ПараметрыОсновныхСредствРЖД
		|		ПО ДанныеДляФормированияДвижений.ОсновноеСредство = ПараметрыОсновныхСредствРЖД.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОсновныхСредств КАК СтоимостьОсновныхСредств
		|		ПО ДанныеДляФормированияДвижений.ОсновноеСредство = СтоимостьОсновныхСредств.ОсновноеСредство";
		
	СтруктураЗапросов.Вставить("Выбытие_Ликвидация_ТекстЗапросаТаблица_абс_ОсновныеСредстваРЖД", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ВыбытиеОсновныхСредств) КАК СчетДт,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства) КАК ВидСубконтоДт1,
		|	ДанныеДляФормированияДвижений.ОсновноеСредство КАК СубконтоДт1,
		|	ПараметрыОсновныхСредствРЖД.СчетУчета КАК СчетКт,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства) КАК ВидСубконтоКт1,
		|	ДанныеДляФормированияДвижений.ОсновноеСредство КАК СубконтоКт1,
		|	ДанныеДляФормированияДвижений.Стоимость КАК Сумма,
		|	&ДокументОснование КАК ПервичныйДокумент
		|ИЗ
		|	ДанныеДляФормированияДвижений КАК ДанныеДляФормированияДвижений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредствРЖД КАК ПараметрыОсновныхСредствРЖД
		|		ПО ДанныеДляФормированияДвижений.ОсновноеСредство = ПараметрыОсновныхСредствРЖД.ОсновноеСредство
		|ГДЕ
		|	ДанныеДляФормированияДвижений.Стоимость <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ПараметрыОсновныхСредствРЖД.СчетНачисленияАмортизации,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|	ДанныеДляФормированияДвижений.ОсновноеСредство,
		|	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ВыбытиеОсновныхСредств),
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|	ДанныеДляФормированияДвижений.ОсновноеСредство,
		|	ДанныеДляФормированияДвижений.Амортизация,
		|	&ДокументОснование
		|ИЗ
		|	ДанныеДляФормированияДвижений КАК ДанныеДляФормированияДвижений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредствРЖД КАК ПараметрыОсновныхСредствРЖД
		|		ПО ДанныеДляФормированияДвижений.ОсновноеСредство = ПараметрыОсновныхСредствРЖД.ОсновноеСредство
		|ГДЕ
		|	ДанныеДляФормированияДвижений.Амортизация <> 0";
		
	СтруктураЗапросов.Вставить("Выбытие_Ликвидация_ТекстЗапросаТаблица_абс_МеждународныйОСРЖД", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"УНИЧТОЖИТЬ ТабличнаяЧастьОсновныеСредства";
		
	СтруктураЗапросов.Вставить("Выбытие_Ликвидация_УдалениеВременныхТаблиц", ТекстЗапроса+";");
	
	
			
	
КонецПроцедуры

Процедура ДобавитьЗапросыДляВыбытие_Остальные(СтруктураЗапросов)

	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_ВыбытиеОСРЖДОсновныеСредства.ОсновноеСредство,
		|	абс_ВыбытиеОСРЖДОсновныеСредства.НачислятьАмортизацию,
		|	ЕСТЬNULL(СоответствиеСчетовХозрасчетныйРЖД.СчетМеждународный, ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ВыбытиеОсновныхСредств)) КАК КоррСчет,
		|	ЕСТЬNULL(абс_ВыбытиеОСРЖДОсновныеСредства.Ссылка.ДокументОснование.СубконтоБУ, абс_ВыбытиеОСРЖДОсновныеСредства.ОсновноеСредство) КАК КоррСубконто1
		|ПОМЕСТИТЬ ТабличнаяЧастьОсновныеСредства
		|ИЗ
		|	Документ.абс_ВыбытиеОСРЖД.ОсновныеСредства КАК абс_ВыбытиеОСРЖДОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйРЖД КАК СоответствиеСчетовХозрасчетныйРЖД
		|		ПО абс_ВыбытиеОСРЖДОсновныеСредства.Ссылка.ДокументОснование.СчетСписанияБУ = СоответствиеСчетовХозрасчетныйРЖД.СчетХозрасчетный
		|			И (СоответствиеСчетовХозрасчетныйРЖД.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Дебет))
		|ГДЕ
		|	абс_ВыбытиеОСРЖДОсновныеСредства.Ссылка = &Ссылка";
		
	СтруктураЗапросов.Вставить("Выбытие_Передача_ТекстЗапросаТабличнаяЧастьОсновныеСредства", ТекстЗапроса+";");
	
    ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_ВыбытиеОСРЖДОсновныеСредства.ОсновноеСредство,
		|	абс_ВыбытиеОСРЖДОсновныеСредства.НачислятьАмортизацию
		|ПОМЕСТИТЬ ТабличнаяЧастьОсновныеСредства
		|ИЗ
		|	Документ.абс_ВыбытиеОСРЖД.ОсновныеСредства КАК абс_ВыбытиеОСРЖДОсновныеСредства
		|ГДЕ
		|	абс_ВыбытиеОСРЖДОсновныеСредства.Ссылка = &Ссылка";
		
	СтруктураЗапросов.Вставить("Выбытие_Списание_ТекстЗапросаТабличнаяЧастьОсновныеСредства", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ТабличнаяЧастьОсновныеСредства.КоррСчет КАК СчетДт,
		|	ВидыСубконтоСчетов.ВидСубконто1 КАК ВидСубконтоДт1,
		|	ТабличнаяЧастьОсновныеСредства.КоррСубконто1 КАК СубконтоДт1,
		|	ПараметрыОсновныхСредствРЖД.СчетУчета КАК СчетКт,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства) КАК ВидСубконтоКт1,
		|	СтоимостьОсновныхСредств.ОсновноеСредство КАК СубконтоКт1,
		|	СтоимостьОсновныхСредств.Стоимость КАК Сумма,
		|	&ДокументОснование КАК ПервичныйДокумент
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОсновныхСредств КАК СтоимостьОсновныхСредств
		|		ПО ТабличнаяЧастьОсновныеСредства.ОсновноеСредство = СтоимостьОсновныхСредств.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредствРЖД КАК ПараметрыОсновныхСредствРЖД
		|		ПО ТабличнаяЧастьОсновныеСредства.ОсновноеСредство = ПараметрыОсновныхСредствРЖД.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
		|		ПО ТабличнаяЧастьОсновныеСредства.КоррСчет = ВидыСубконтоСчетов.Счет
		|ГДЕ
		|	СтоимостьОсновныхСредств.Стоимость <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ПараметрыОсновныхСредствРЖД.СчетНачисленияАмортизации,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|	СтоимостьОсновныхСредств.ОсновноеСредство,
		|	ТабличнаяЧастьОсновныеСредства.КоррСчет,
		|	ВидыСубконтоСчетов.ВидСубконто1,
		|	ТабличнаяЧастьОсновныеСредства.КоррСубконто1,
		|	СтоимостьОсновныхСредств.Амортизация,
		|	&ДокументОснование
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОсновныхСредств КАК СтоимостьОсновныхСредств
		|		ПО ТабличнаяЧастьОсновныеСредства.ОсновноеСредство = СтоимостьОсновныхСредств.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредствРЖД КАК ПараметрыОсновныхСредствРЖД
		|		ПО ТабличнаяЧастьОсновныеСредства.ОсновноеСредство = ПараметрыОсновныхСредствРЖД.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
		|		ПО ТабличнаяЧастьОсновныеСредства.КоррСчет = ВидыСубконтоСчетов.Счет
		|ГДЕ
		|	СтоимостьОсновныхСредств.Амортизация <> 0";
		
	СтруктураЗапросов.Вставить("Выбытие_Передача_ТекстЗапросаТаблица_абс_МеждународныйОСРЖД", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ВыбытиеОсновныхСредств) КАК СчетДт,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства) КАК ВидСубконтоДт1,
		|	СтоимостьОсновныхСредств.ОсновноеСредство КАК СубконтоДт1,
		|	ПараметрыОсновныхСредствРЖД.СчетУчета КАК СчетКт,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства) КАК ВидСубконтоКт1,
		|	СтоимостьОсновныхСредств.ОсновноеСредство КАК СубконтоКт1,
		|	СтоимостьОсновныхСредств.Стоимость КАК Сумма,
		|	&ДокументОснование КАК ПервичныйДокумент
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОсновныхСредств КАК СтоимостьОсновныхСредств
		|		ПО ТабличнаяЧастьОсновныеСредства.ОсновноеСредство = СтоимостьОсновныхСредств.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредствРЖД КАК ПараметрыОсновныхСредствРЖД
		|		ПО ТабличнаяЧастьОсновныеСредства.ОсновноеСредство = ПараметрыОсновныхСредствРЖД.ОсновноеСредство
		|ГДЕ
		|	СтоимостьОсновныхСредств.Стоимость <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ПараметрыОсновныхСредствРЖД.СчетНачисленияАмортизации,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|	СтоимостьОсновныхСредств.ОсновноеСредство,
		|	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ВыбытиеОсновныхСредств),
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|	СтоимостьОсновныхСредств.ОсновноеСредство,
		|	СтоимостьОсновныхСредств.Амортизация,
		|	&ДокументОснование
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОсновныхСредств КАК СтоимостьОсновныхСредств
		|		ПО ТабличнаяЧастьОсновныеСредства.ОсновноеСредство = СтоимостьОсновныхСредств.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредствРЖД КАК ПараметрыОсновныхСредствРЖД
		|		ПО ТабличнаяЧастьОсновныеСредства.ОсновноеСредство = ПараметрыОсновныхСредствРЖД.ОсновноеСредство
		|ГДЕ
		|	СтоимостьОсновныхСредств.Амортизация <> 0";
		
	СтруктураЗапросов.Вставить("Выбытие_Списание_ТекстЗапросаТаблица_абс_МеждународныйОСРЖД", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_СтоимостьОСРЖДОстатки.ОсновноеСредство,
		|	абс_СтоимостьОСРЖДОстатки.СтоимостьОстаток КАК Стоимость,
		|	абс_СтоимостьОСРЖДОстатки.АмортизацияОстаток КАК Амортизация
		|ПОМЕСТИТЬ СтоимостьОсновныхСредств
		|ИЗ
		|	РегистрНакопления.абс_СтоимостьОСРЖД.Остатки(
		|			&МоментДокумента,
		|			ОсновноеСредство В
		|					(ВЫБРАТЬ
		|						ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
		|					ИЗ
		|						ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства)
		|				И Организация = &Организация) КАК абс_СтоимостьОСРЖДОстатки";
		
	СтруктураЗапросов.Вставить("Выбытие_Списание_ТекстЗапросаСтоимостьОсновныхСредств", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПериодыРегистраторыСреза.Период,
		|	ПериодыРегистраторыСреза.Регистратор,
		|	ПериодыРегистраторыСреза.ОсновноеСредство,
		|	абс_ОсновныеСредстваРЖД.Организация,
		|	абс_ОсновныеСредстваРЖД.ДатаПринятияКУчету,
		|	абс_ОсновныеСредстваРЖД.МестонахождениеОбъекта,
		|	абс_ОсновныеСредстваРЖД.МОЛ,
		|	абс_ОсновныеСредстваРЖД.Состояние,
		|	абс_ОсновныеСредстваРЖД.СчетУчета,
		|	абс_ОсновныеСредстваРЖД.СрокПолезногоИспользования,
		|	абс_ОсновныеСредстваРЖД.НачислятьАмортизацию,
		|	абс_ОсновныеСредстваРЖД.МетодНачисленияАмортизации,
		|	абс_ОсновныеСредстваРЖД.СчетНачисленияАмортизации,
		|	абс_ОсновныеСредстваРЖД.ПервоначальнаяСтоимость,
		|	абс_ОсновныеСредстваРЖД.СправедливаяСтоимость,
		|	абс_ОсновныеСредстваРЖД.ЛиквидационнаяСтоимость,
		|	абс_ОсновныеСредстваРЖД.СчетЗатрат,
		|	абс_ОсновныеСредстваРЖД.Субконто1,
		|	абс_ОсновныеСредстваРЖД.Субконто2,
		|	абс_ОсновныеСредстваРЖД.Субконто3,
		|	абс_ОсновныеСредстваРЖД.ПредполагаемыйОбъемПродукции,
		|	абс_ОсновныеСредстваРЖД.СуммаНачисленнойАмортизации,
		|	абс_ОсновныеСредстваРЖД.УбытокОтОбесценения,
		|	абс_ОсновныеСредстваРЖД.КоэффициентУскорения,
		|	абс_ОсновныеСредстваРЖД.СчетСниженияСтоимости
		|ПОМЕСТИТЬ ПараметрыОсновныхСредствРЖД
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
		|		ПериодыСреза.Период КАК Период,
		|		МАКСИМУМ(абс_ОсновныеСредстваРЖД.Регистратор) КАК Регистратор
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ТабличнаяЧастьОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|			МАКСИМУМ(абс_ОсновныеСредстваРЖД.Период) КАК Период
		|		ИЗ
		|			ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
		|				ПО ТабличнаяЧастьОсновныеСредства.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство
		|					И (абс_ОсновныеСредстваРЖД.Период <= &Период)
		|					И (абс_ОсновныеСредстваРЖД.Активность)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТабличнаяЧастьОсновныеСредства.ОсновноеСредство) КАК ПериодыСреза
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
		|			ПО ПериодыСреза.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство
		|				И ПериодыСреза.Период = абс_ОсновныеСредстваРЖД.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПериодыСреза.ОсновноеСредство,
		|		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
		|		ПО ПериодыРегистраторыСреза.Период = абс_ОсновныеСредстваРЖД.Период
		|			И ПериодыРегистраторыСреза.Регистратор = абс_ОсновныеСредстваРЖД.Регистратор
		|			И ПериодыРегистраторыСреза.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство";
		
	СтруктураЗапросов.Вставить("абс_ВнеоборотныеАктивы_ТекстЗапроса_ОсновныеСредстваРЖДПоТаблицеОС", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Организация,
		|	СтоимостьОсновныхСредств.ОсновноеСредство,
		|	СтоимостьОсновныхСредств.Стоимость,
		|	СтоимостьОсновныхСредств.Амортизация
		|ИЗ
		|	СтоимостьОсновныхСредств КАК СтоимостьОсновныхСредств";
		
	СтруктураЗапросов.Вставить("Выбытие_Списание_ТекстЗапросаТаблица_абс_СтоимостьОСРЖД", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	ПараметрыОсновныхСредствРЖД.ОсновноеСредство,
		|	&организация,
		|	ПараметрыОсновныхСредствРЖД.ДатаПринятияКУчету,
		|	ПараметрыОсновныхСредствРЖД.МестонахождениеОбъекта,
		|	ПараметрыОсновныхСредствРЖД.МОЛ,
		|	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета) КАК Состояние,
		|	ПараметрыОсновныхСредствРЖД.СчетУчета,
		|	ПараметрыОсновныхСредствРЖД.СрокПолезногоИспользования,
		|	ЛОЖЬ КАК НачислятьАмортизацию,
		|	ПараметрыОсновныхСредствРЖД.МетодНачисленияАмортизации,
		|	ПараметрыОсновныхСредствРЖД.СчетНачисленияАмортизации,
		|	ПараметрыОсновныхСредствРЖД.ПервоначальнаяСтоимость,
		|	0 КАК СправедливаяСтоимость,
		|	0 КАК ЛиквидационнаяСтоимость,
		|	ПараметрыОсновныхСредствРЖД.СчетЗатрат,
		|	ПараметрыОсновныхСредствРЖД.Субконто1,
		|	ПараметрыОсновныхСредствРЖД.Субконто2,
		|	ПараметрыОсновныхСредствРЖД.Субконто3,
		|	ПараметрыОсновныхСредствРЖД.ПредполагаемыйОбъемПродукции,
		|	0 КАК СуммаНачисленнойАмортизации,
		|	ПараметрыОсновныхСредствРЖД.УбытокОтОбесценения,
		|	ПараметрыОсновныхСредствРЖД.КоэффициентУскорения,
		|	ПараметрыОсновныхСредствРЖД.СчетСниженияСтоимости
		|ИЗ
		|	ПараметрыОсновныхСредствРЖД КАК ПараметрыОсновныхСредствРЖД";
		
	СтруктураЗапросов.Вставить("Выбытие_Списание_ТекстЗапросаТаблица_абс_ОсновныеСредстваРЖД", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"УНИЧТОЖИТЬ ТабличнаяЧастьОсновныеСредства";
		
	СтруктураЗапросов.Вставить("Выбытие_Списание_УдалениеВременныхТаблиц", ТекстЗапроса+";");
	
				
КонецПроцедуры












/////////////////////////////////////////////////////////////////////////////////
// Программный интерфейс проведения документов

Процедура ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Ссылка.Дата);
	Запрос.УстановитьПараметр("МоментДокумента", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", Ссылка.Организация);
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка.ДокументОснование);
	
	ТекстыЗапросов = Новый СписокЗначений;
	
	ТекстыЗапросов.Добавить(абс_МеждународныйУчетОСРЖД.ТекстЗапросаВидыСубконтоСчетов("ВидыСубконтоСчетов"), "");
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличнаяЧастьОсновныеСредства(), "");
	ТекстыЗапросов.Добавить(ТекстЗапросаНесуммовыеПараметрыОсновныхСредств(), "");
	ТекстыЗапросов.Добавить(ТекстЗапросаНовыйПараметрыОсновныхСредств(), "");
	ТекстыЗапросов.Добавить(абс_ВнеоборотныеАктивы.ТекстЗапроса_ОсновныеСредстваРЖДПоТаблицеОС("ТабличнаяЧастьОсновныеСредства", "Период", "ПараметрыОсновныхСредств"), "");
	ТекстыЗапросов.Добавить(ТекстЗапросаСтараяСтоимостьОсновныхСредств(), "");

	
	ТекстыЗапросов.Добавить(ТекстЗапросаТаблица_абс_ОсновныеСредстваРЖД(), "Таблица_абс_ОсновныеСредстваРЖД");
	ТекстыЗапросов.Добавить(ТекстЗапросаТаблица_абс_СтоимостьОСРЖД(), "Таблица_абс_СтоимостьОСРЖД");
	ТекстыЗапросов.Добавить(ТекстЗапросаТаблица_абс_МеждународныйОСРЖД(), "Таблица_абс_МеждународныйОСРЖД");
	
	абс_ПроведениеДокументов.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапросов, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////
// Функции, возвращающие тексты запросов для инициализации данных документа

Функция ОбщийЗапрос()
	
	Возврат "ВЫБРАТЬ
	        |	абс_МеждународныйОСРЖД.Ссылка КАК Счет,
	        |	абс_МеждународныйОСРЖДВидыСубконто1.ВидСубконто КАК ВидСубконто1,
	        |	абс_МеждународныйОСРЖДВидыСубконто2.ВидСубконто КАК ВидСубконто2,
	        |	абс_МеждународныйОСРЖДВидыСубконто.ВидСубконто КАК ВидСубконто3
	        |ПОМЕСТИТЬ ВидыСубконтоСчетов
	        |ИЗ
	        |	ПланСчетов.абс_МеждународныйОСРЖД.ВидыСубконто КАК абс_МеждународныйОСРЖДВидыСубконто
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.абс_МеждународныйОСРЖД КАК абс_МеждународныйОСРЖД
	        |		ПО абс_МеждународныйОСРЖДВидыСубконто.Ссылка = абс_МеждународныйОСРЖД.Ссылка,
	        |	ПланСчетов.абс_МеждународныйОСРЖД.ВидыСубконто КАК абс_МеждународныйОСРЖДВидыСубконто1,
	        |	ПланСчетов.абс_МеждународныйОСРЖД.ВидыСубконто КАК абс_МеждународныйОСРЖДВидыСубконто2
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.ОсновноеСредство,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.ДатаПринятияКУчету,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.МестонахождениеОбъекта,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.МОЛ,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СрокПолезногоИспользования,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоэффициентУскорения,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Стоимость,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СуммаНачисленнойАмортизации,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СправедливаяСтоимость,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.ЛиквидационнаяСтоимость,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.УбытокОтОбесценения,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СчетУчета,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СчетНачисленияАмортизации,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СчетЗатрат,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Субконто1,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Субконто2,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Субконто3,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СчетСниженияСтоимости,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.НачислятьАмортизацию,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.МетодНачисленияАмортизации,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.ПредполагаемыйОбъемПродукции,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Состояние,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоррСчет,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоррСубконто1,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоррСубконто2,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоррСубконто3
	        |ПОМЕСТИТЬ ТабличнаяЧастьОсновныеСредства
	        |ИЗ
	        |	Документ.абс_ПоступлениеОСРЖД.ОсновныеСредства КАК абс_ПоступлениеОСРЖДОсновныеСредства
	        |ГДЕ
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Ссылка = &Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
	        |	ТабличнаяЧастьОсновныеСредства.ДатаПринятияКУчету,
	        |	ТабличнаяЧастьОсновныеСредства.МестонахождениеОбъекта,
	        |	ТабличнаяЧастьОсновныеСредства.МОЛ,
	        |	ТабличнаяЧастьОсновныеСредства.СрокПолезногоИспользования,
	        |	ТабличнаяЧастьОсновныеСредства.КоэффициентУскорения,
	        |	ТабличнаяЧастьОсновныеСредства.СчетУчета,
	        |	ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации,
	        |	ТабличнаяЧастьОсновныеСредства.СчетЗатрат,
	        |	ТабличнаяЧастьОсновныеСредства.Субконто1,
	        |	ТабличнаяЧастьОсновныеСредства.Субконто2,
	        |	ТабличнаяЧастьОсновныеСредства.Субконто3,
	        |	ТабличнаяЧастьОсновныеСредства.СчетСниженияСтоимости,
	        |	ТабличнаяЧастьОсновныеСредства.НачислятьАмортизацию,
	        |	ТабличнаяЧастьОсновныеСредства.МетодНачисленияАмортизации,
	        |	ТабличнаяЧастьОсновныеСредства.ПредполагаемыйОбъемПродукции,
	        |	ТабличнаяЧастьОсновныеСредства.Состояние
	        |ПОМЕСТИТЬ НесуммовыеПараметрыОсновныхСредств
	        |ИЗ
	        |	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	НесуммовыеПараметрыОсновныхСредств.ОсновноеСредство,
	        |	НесуммовыеПараметрыОсновныхСредств.ДатаПринятияКУчету,
	        |	НесуммовыеПараметрыОсновныхСредств.МестонахождениеОбъекта,
	        |	НесуммовыеПараметрыОсновныхСредств.МОЛ,
	        |	НесуммовыеПараметрыОсновныхСредств.СрокПолезногоИспользования,
	        |	НесуммовыеПараметрыОсновныхСредств.КоэффициентУскорения,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетУчета,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетНачисленияАмортизации,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетЗатрат,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто1,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто2,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто3,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетСниженияСтоимости,
	        |	НесуммовыеПараметрыОсновныхСредств.НачислятьАмортизацию,
	        |	НесуммовыеПараметрыОсновныхСредств.МетодНачисленияАмортизации,
	        |	НесуммовыеПараметрыОсновныхСредств.ПредполагаемыйОбъемПродукции,
	        |	НесуммовыеПараметрыОсновныхСредств.Состояние,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.Стоимость) КАК Стоимость,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации) КАК СуммаНачисленнойАмортизации,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.СправедливаяСтоимость) КАК СправедливаяСтоимость,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.ЛиквидационнаяСтоимость) КАК ЛиквидационнаяСтоимость,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.УбытокОтОбесценения) КАК УбытокОтОбесценения
	        |ПОМЕСТИТЬ НовыеПараметрыОсновныхСредств
	        |ИЗ
	        |	НесуммовыеПараметрыОсновныхСредств КАК НесуммовыеПараметрыОсновныхСредств
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |		ПО НесуммовыеПараметрыОсновныхСредств.ОсновноеСредство = ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	НесуммовыеПараметрыОсновныхСредств.ДатаПринятияКУчету,
	        |	НесуммовыеПараметрыОсновныхСредств.ОсновноеСредство,
	        |	НесуммовыеПараметрыОсновныхСредств.МестонахождениеОбъекта,
	        |	НесуммовыеПараметрыОсновныхСредств.МОЛ,
	        |	НесуммовыеПараметрыОсновныхСредств.СрокПолезногоИспользования,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетУчета,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетСниженияСтоимости,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто2,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто3,
	        |	НесуммовыеПараметрыОсновныхСредств.МетодНачисленияАмортизации,
	        |	НесуммовыеПараметрыОсновныхСредств.НачислятьАмортизацию,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетНачисленияАмортизации,
	        |	НесуммовыеПараметрыОсновныхСредств.Состояние,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто1,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетЗатрат,
	        |	НесуммовыеПараметрыОсновныхСредств.КоэффициентУскорения,
	        |	НесуммовыеПараметрыОсновныхСредств.ПредполагаемыйОбъемПродукции
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	абс_ОсновныеСредстваРЖД.Период,
	        |	абс_ОсновныеСредстваРЖД.Регистратор,
	        |	абс_ОсновныеСредстваРЖД.ОсновноеСредство,
	        |	абс_ОсновныеСредстваРЖД.Организация,
	        |	абс_ОсновныеСредстваРЖД.ДатаПринятияКУчету,
	        |	абс_ОсновныеСредстваРЖД.МестонахождениеОбъекта,
	        |	абс_ОсновныеСредстваРЖД.МОЛ,
	        |	абс_ОсновныеСредстваРЖД.Состояние,
	        |	абс_ОсновныеСредстваРЖД.СчетУчета,
	        |	абс_ОсновныеСредстваРЖД.СрокПолезногоИспользования,
	        |	абс_ОсновныеСредстваРЖД.НачислятьАмортизацию,
	        |	абс_ОсновныеСредстваРЖД.МетодНачисленияАмортизации,
	        |	абс_ОсновныеСредстваРЖД.СчетНачисленияАмортизации,
	        |	абс_ОсновныеСредстваРЖД.ПервоначальнаяСтоимость,
	        |	абс_ОсновныеСредстваРЖД.СправедливаяСтоимость,
	        |	абс_ОсновныеСредстваРЖД.ЛиквидационнаяСтоимость,
	        |	абс_ОсновныеСредстваРЖД.СчетЗатрат,
	        |	абс_ОсновныеСредстваРЖД.Субконто1,
	        |	абс_ОсновныеСредстваРЖД.Субконто2,
	        |	абс_ОсновныеСредстваРЖД.Субконто3,
	        |	абс_ОсновныеСредстваРЖД.ПредполагаемыйОбъемПродукции,
	        |	абс_ОсновныеСредстваРЖД.СуммаНачисленнойАмортизации,
	        |	абс_ОсновныеСредстваРЖД.УбытокОтОбесценения,
	        |	абс_ОсновныеСредстваРЖД.КоэффициентУскорения,
	        |	абс_ОсновныеСредстваРЖД.СчетСниженияСтоимости
	        |ПОМЕСТИТЬ ПараметрыОсновныхСредств
	        |ИЗ
	        |	РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	абс_СтоимостьОСРЖДОстатки.ОсновноеСредство КАК ОсновноеСредство,
	        |	абс_СтоимостьОСРЖДОстатки.СтоимостьОстаток КАК Стоимость,
	        |	абс_СтоимостьОСРЖДОстатки.АмортизацияОстаток КАК Амортизация
	        |ПОМЕСТИТЬ СтараяСтоимостьОсновныхСредств
	        |ИЗ
	        |	РегистрНакопления.абс_СтоимостьОСРЖД.Остатки(
	        |			&МоментДокумента,
	        |			ОсновноеСредство В
	        |					(ВЫБРАТЬ
	        |						ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
	        |					ИЗ
	        |						ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства)
	        |				И Организация = &Организация) КАК абс_СтоимостьОСРЖДОстатки
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	&Период,
	        |	НовыеПараметрыОсновныхСредств.ОсновноеСредство,
	        |	&Организация,
	        |	НовыеПараметрыОсновныхСредств.ДатаПринятияКУчету,
	        |	НовыеПараметрыОсновныхСредств.МестонахождениеОбъекта,
	        |	НовыеПараметрыОсновныхСредств.МОЛ,
	        |	НовыеПараметрыОсновныхСредств.СрокПолезногоИспользования,
	        |	НовыеПараметрыОсновныхСредств.КоэффициентУскорения,
	        |	НовыеПараметрыОсновныхСредств.СуммаНачисленнойАмортизации + ЕСТЬNULL(СтараяСтоимостьОсновныхСредств.Амортизация, 0) КАК СуммаНакопленнойАмортизации,
	        |	НовыеПараметрыОсновныхСредств.СправедливаяСтоимость + ЕСТЬNULL(ПараметрыОсновныхСредств.СправедливаяСтоимость, 0) КАК СправедливаяСтоимость,
	        |	НовыеПараметрыОсновныхСредств.ЛиквидационнаяСтоимость + ЕСТЬNULL(ПараметрыОсновныхСредств.ЛиквидационнаяСтоимость, 0) КАК ЛиквидационнаяСтоимость,
	        |	НовыеПараметрыОсновныхСредств.УбытокОтОбесценения + ЕСТЬNULL(ПараметрыОсновныхСредств.УбытокОтОбесценения, 0) КАК УбытокОтОбесценения,
	        |	НовыеПараметрыОсновныхСредств.СчетУчета,
	        |	НовыеПараметрыОсновныхСредств.СчетНачисленияАмортизации,
	        |	НовыеПараметрыОсновныхСредств.СчетЗатрат,
	        |	НовыеПараметрыОсновныхСредств.Субконто1,
	        |	НовыеПараметрыОсновныхСредств.Субконто2,
	        |	НовыеПараметрыОсновныхСредств.Субконто3,
	        |	НовыеПараметрыОсновныхСредств.СчетСниженияСтоимости,
	        |	НовыеПараметрыОсновныхСредств.НачислятьАмортизацию,
	        |	НовыеПараметрыОсновныхСредств.МетодНачисленияАмортизации,
	        |	НовыеПараметрыОсновныхСредств.ПредполагаемыйОбъемПродукции,
	        |	НовыеПараметрыОсновныхСредств.Состояние
	        |ПОМЕСТИТЬ Таблица_абс_ОсновныеСредстваРЖД
	        |ИЗ
	        |	НовыеПараметрыОсновныхСредств КАК НовыеПараметрыОсновныхСредств
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СтараяСтоимостьОсновныхСредств КАК СтараяСтоимостьОсновныхСредств
	        |		ПО НовыеПараметрыОсновныхСредств.ОсновноеСредство = СтараяСтоимостьОсновныхСредств.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредств КАК ПараметрыОсновныхСредств
	        |		ПО НовыеПараметрыОсновныхСредств.ОсновноеСредство = ПараметрыОсновныхСредств.ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&Период,
	        |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	        |	&Организация,
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
	        |	ТабличнаяЧастьОсновныеСредства.Стоимость,
	        |	ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации КАК Амортизация
	        |ПОМЕСТИТЬ Таблица_абс_СтоимостьОСРЖД
	        |ИЗ
	        |	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |ГДЕ
	        |	(ТабличнаяЧастьОсновныеСредства.Стоимость <> 0
	        |			ИЛИ ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации <> 0)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&Период,
	        |	&Организация,
	        |	ТабличнаяЧастьОсновныеСредства.СчетУчета КАК СчетДт,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства) КАК ВидСубконтоДт1,
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство КАК СубконтоДт1,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка) КАК ВидСубконтоДт2,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка) КАК ВидСубконтоДт3,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСчет КАК СчетКт,
	        |	ВидыСубконтоСчетов.ВидСубконто1 КАК ВидСубконтоКт1,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто1 КАК СубконтоКт1,
	        |	ВидыСубконтоСчетов.ВидСубконто2 КАК ВидСубконтоКт2,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто2 КАК СубконтоКт2,
	        |	ВидыСубконтоСчетов.ВидСубконто3 КАК ВидСубконтоКт3,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто3 КАК СубконтоКт3,
	        |	ТабличнаяЧастьОсновныеСредства.Стоимость КАК Сумма,
	        |	&ДокументОснование КАК ПервичныйДокумент
	        |ПОМЕСТИТЬ Таблица_абс_МеждународныйОСРЖД
	        |ИЗ
	        |	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
	        |		ПО ТабличнаяЧастьОсновныеСредства.КоррСчет = ВидыСубконтоСчетов.Счет
	        |ГДЕ
	        |	ТабличнаяЧастьОсновныеСредства.Стоимость <> 0
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&Период,
	        |	&Организация,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСчет,
	        |	ВидыСубконтоСчетов.ВидСубконто1,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто1,
	        |	ВидыСубконтоСчетов.ВидСубконто2,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто2,
	        |	ВидыСубконтоСчетов.ВидСубконто3,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто3,
	        |	ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка),
	        |	НЕОПРЕДЕЛЕНО,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка),
	        |	НЕОПРЕДЕЛЕНО,
	        |	ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации,
	        |	&ДокументОснование
	        |ИЗ
	        |	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства,
	        |	ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
	        |ГДЕ
	        |	ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации <> 0";
	
КонецФункции

Функция ТекстЗапросаТабличнаяЧастьОсновныеСредства()
	
	Возврат "ВЫБРАТЬ
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.ОсновноеСредство,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.ДатаПринятияКУчету,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.МестонахождениеОбъекта,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.МОЛ,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СрокПолезногоИспользования,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоэффициентУскорения,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Стоимость,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СуммаНачисленнойАмортизации,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СправедливаяСтоимость,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.ЛиквидационнаяСтоимость,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.УбытокОтОбесценения,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СчетУчета,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СчетНачисленияАмортизации,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СчетЗатрат,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Субконто1,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Субконто2,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Субконто3,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СчетСниженияСтоимости,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.НачислятьАмортизацию,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.МетодНачисленияАмортизации,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.ПредполагаемыйОбъемПродукции,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Состояние,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоррСчет,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоррСубконто1,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоррСубконто2,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоррСубконто3
	        |ПОМЕСТИТЬ ТабличнаяЧастьОсновныеСредства
	        |ИЗ
	        |	Документ.абс_ПоступлениеОСРЖД.ОсновныеСредства КАК абс_ПоступлениеОСРЖДОсновныеСредства
	        |ГДЕ
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Ссылка = &Ссылка
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаСтараяСтоимостьОсновныхСредств()
	
	Возврат "ВЫБРАТЬ
	        |	абс_СтоимостьОСРЖДОстатки.ОсновноеСредство КАК ОсновноеСредство,
	        |	абс_СтоимостьОСРЖДОстатки.СтоимостьОстаток КАК Стоимость,
	        |	абс_СтоимостьОСРЖДОстатки.АмортизацияОстаток КАК Амортизация
	        |ПОМЕСТИТЬ СтараяСтоимостьОсновныхСредств
	        |ИЗ
	        |	РегистрНакопления.абс_СтоимостьОСРЖД.Остатки(
	        |			&МоментДокумента,
	        |			ОсновноеСредство В
	        |					(ВЫБРАТЬ
	        |						ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
	        |					ИЗ
	        |						ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства)
	        |				И Организация = &Организация) КАК абс_СтоимостьОСРЖДОстатки
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаНесуммовыеПараметрыОсновныхСредств()
	
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
	        |	ТабличнаяЧастьОсновныеСредства.ДатаПринятияКУчету,
	        |	ТабличнаяЧастьОсновныеСредства.МестонахождениеОбъекта,
	        |	ТабличнаяЧастьОсновныеСредства.МОЛ,
	        |	ТабличнаяЧастьОсновныеСредства.СрокПолезногоИспользования,
	        |	ТабличнаяЧастьОсновныеСредства.КоэффициентУскорения,
	        |	ТабличнаяЧастьОсновныеСредства.СчетУчета,
	        |	ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации,
	        |	ТабличнаяЧастьОсновныеСредства.СчетЗатрат,
	        |	ТабличнаяЧастьОсновныеСредства.Субконто1,
	        |	ТабличнаяЧастьОсновныеСредства.Субконто2,
	        |	ТабличнаяЧастьОсновныеСредства.Субконто3,
	        |	ТабличнаяЧастьОсновныеСредства.СчетСниженияСтоимости,
	        |	ТабличнаяЧастьОсновныеСредства.НачислятьАмортизацию,
	        |	ТабличнаяЧастьОсновныеСредства.МетодНачисленияАмортизации,
	        |	ТабличнаяЧастьОсновныеСредства.ПредполагаемыйОбъемПродукции,
	        |	ТабличнаяЧастьОсновныеСредства.Состояние
	        |ПОМЕСТИТЬ НесуммовыеПараметрыОсновныхСредств
	        |ИЗ
	        |	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаНовыйПараметрыОсновныхСредств()
	
	Возврат "ВЫБРАТЬ
	        |	НесуммовыеПараметрыОсновныхСредств.ОсновноеСредство,
	        |	НесуммовыеПараметрыОсновныхСредств.ДатаПринятияКУчету,
	        |	НесуммовыеПараметрыОсновныхСредств.МестонахождениеОбъекта,
	        |	НесуммовыеПараметрыОсновныхСредств.МОЛ,
	        |	НесуммовыеПараметрыОсновныхСредств.СрокПолезногоИспользования,
	        |	НесуммовыеПараметрыОсновныхСредств.КоэффициентУскорения,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетУчета,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетНачисленияАмортизации,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетЗатрат,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто1,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто2,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто3,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетСниженияСтоимости,
	        |	НесуммовыеПараметрыОсновныхСредств.НачислятьАмортизацию,
	        |	НесуммовыеПараметрыОсновныхСредств.МетодНачисленияАмортизации,
	        |	НесуммовыеПараметрыОсновныхСредств.ПредполагаемыйОбъемПродукции,
	        |	НесуммовыеПараметрыОсновныхСредств.Состояние,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.Стоимость) КАК Стоимость,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации) КАК СуммаНачисленнойАмортизации,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.СправедливаяСтоимость) КАК СправедливаяСтоимость,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.ЛиквидационнаяСтоимость) КАК ЛиквидационнаяСтоимость,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.УбытокОтОбесценения) КАК УбытокОтОбесценения
	        |ПОМЕСТИТЬ НовыеПараметрыОсновныхСредств
	        |ИЗ
	        |	НесуммовыеПараметрыОсновныхСредств КАК НесуммовыеПараметрыОсновныхСредств
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |		ПО НесуммовыеПараметрыОсновныхСредств.ОсновноеСредство = ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	НесуммовыеПараметрыОсновныхСредств.ДатаПринятияКУчету,
	        |	НесуммовыеПараметрыОсновныхСредств.ОсновноеСредство,
	        |	НесуммовыеПараметрыОсновныхСредств.МестонахождениеОбъекта,
	        |	НесуммовыеПараметрыОсновныхСредств.МОЛ,
	        |	НесуммовыеПараметрыОсновныхСредств.СрокПолезногоИспользования,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетУчета,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетСниженияСтоимости,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто2,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто3,
	        |	НесуммовыеПараметрыОсновныхСредств.МетодНачисленияАмортизации,
	        |	НесуммовыеПараметрыОсновныхСредств.НачислятьАмортизацию,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетНачисленияАмортизации,
	        |	НесуммовыеПараметрыОсновныхСредств.Состояние,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто1,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетЗатрат,
	        |	НесуммовыеПараметрыОсновныхСредств.КоэффициентУскорения,
	        |	НесуммовыеПараметрыОсновныхСредств.ПредполагаемыйОбъемПродукции
			|;
			|";
	
КонецФункции



Функция ТекстЗапросаТаблица_абс_ОсновныеСредстваРЖД()
	
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	&Период,
	        |	НовыеПараметрыОсновныхСредств.ОсновноеСредство,
	        |	&Организация,
	        |	НовыеПараметрыОсновныхСредств.ДатаПринятияКУчету,
	        |	НовыеПараметрыОсновныхСредств.МестонахождениеОбъекта,
	        |	НовыеПараметрыОсновныхСредств.МОЛ,
	        |	НовыеПараметрыОсновныхСредств.СрокПолезногоИспользования,
	        |	НовыеПараметрыОсновныхСредств.КоэффициентУскорения,
	        |	НовыеПараметрыОсновныхСредств.СуммаНачисленнойАмортизации + ЕСТЬNULL(СтараяСтоимостьОсновныхСредств.Амортизация, 0) КАК СуммаНакопленнойАмортизации,
	        |	НовыеПараметрыОсновныхСредств.СправедливаяСтоимость + ЕСТЬNULL(ПараметрыОсновныхСредств.СправедливаяСтоимость, 0) КАК СправедливаяСтоимость,
	        |	НовыеПараметрыОсновныхСредств.ЛиквидационнаяСтоимость + ЕСТЬNULL(ПараметрыОсновныхСредств.ЛиквидационнаяСтоимость, 0) КАК ЛиквидационнаяСтоимость,
	        |	НовыеПараметрыОсновныхСредств.УбытокОтОбесценения + ЕСТЬNULL(ПараметрыОсновныхСредств.УбытокОтОбесценения, 0) КАК УбытокОтОбесценения,
	        |	НовыеПараметрыОсновныхСредств.СчетУчета,
	        |	НовыеПараметрыОсновныхСредств.СчетНачисленияАмортизации,
	        |	НовыеПараметрыОсновныхСредств.СчетЗатрат,
	        |	НовыеПараметрыОсновныхСредств.Субконто1,
	        |	НовыеПараметрыОсновныхСредств.Субконто2,
	        |	НовыеПараметрыОсновныхСредств.Субконто3,
	        |	НовыеПараметрыОсновныхСредств.СчетСниженияСтоимости,
	        |	НовыеПараметрыОсновныхСредств.НачислятьАмортизацию,
	        |	НовыеПараметрыОсновныхСредств.МетодНачисленияАмортизации,
	        |	НовыеПараметрыОсновныхСредств.ПредполагаемыйОбъемПродукции,
	        |	НовыеПараметрыОсновныхСредств.Состояние
	        |ИЗ
	        |	НовыеПараметрыОсновныхСредств КАК НовыеПараметрыОсновныхСредств
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СтараяСтоимостьОсновныхСредств КАК СтараяСтоимостьОсновныхСредств
	        |		ПО НовыеПараметрыОсновныхСредств.ОсновноеСредство = СтараяСтоимостьОсновныхСредств.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредств КАК ПараметрыОсновныхСредств
	        |		ПО НовыеПараметрыОсновныхСредств.ОсновноеСредство = ПараметрыОсновныхСредств.ОсновноеСредство
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаТаблица_абс_СтоимостьОСРЖД()
	
	Возврат "ВЫБРАТЬ
	        |	&Период,
	        |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	        |	&Организация,
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
	        |	ТабличнаяЧастьОсновныеСредства.Стоимость,
	        |	ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации КАК Амортизация
	        |ИЗ
	        |	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |ГДЕ
	        |	(ТабличнаяЧастьОсновныеСредства.Стоимость <> 0
	        |			ИЛИ ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации <> 0)
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаТаблица_абс_МеждународныйОСРЖД()
	
	Возврат "ВЫБРАТЬ
	        |	&Период,
	        |	&Организация,
	        |	ТабличнаяЧастьОсновныеСредства.СчетУчета КАК СчетДт,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства) КАК ВидСубконтоДт1,
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство КАК СубконтоДт1,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка) КАК ВидСубконтоДт2,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка) КАК ВидСубконтоДт3,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСчет КАК СчетКт,
	        |	ВидыСубконтоСчетов.ВидСубконто1 КАК ВидСубконтоКт1,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто1 КАК СубконтоКт1,
	        |	ВидыСубконтоСчетов.ВидСубконто2 КАК ВидСубконтоКт2,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто2 КАК СубконтоКт2,
	        |	ВидыСубконтоСчетов.ВидСубконто3 КАК ВидСубконтоКт3,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто3 КАК СубконтоКт3,
	        |	ТабличнаяЧастьОсновныеСредства.Стоимость КАК Сумма,
	        |	&ДокументОснование КАК ПервичныйДокумент
	        |ИЗ
	        |	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
	        |		ПО ТабличнаяЧастьОсновныеСредства.КоррСчет = ВидыСубконтоСчетов.Счет
	        |ГДЕ
	        |	ТабличнаяЧастьОсновныеСредства.Стоимость <> 0
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&Период,
	        |	&Организация,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСчет,
	        |	ВидыСубконтоСчетов.ВидСубконто1,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто1,
	        |	ВидыСубконтоСчетов.ВидСубконто2,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто2,
	        |	ВидыСубконтоСчетов.ВидСубконто3,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто3,
	        |	ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка),
	        |	НЕОПРЕДЕЛЕНО,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка),
	        |	НЕОПРЕДЕЛЕНО,
	        |	ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации,
	        |	&ДокументОснование
	        |ИЗ
	        |	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства,
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
	        |		ПО ТабличнаяЧастьОсновныеСредства.КоррСчет = ВидыСубконтоСчетов.Счет
	        |ГДЕ
	        |	ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации <> 0
			|;
			|";
	
КонецФункции
